// ! 1. створити функцію fetchBreeds(), яка не приймає жодного параметра
// задача цієї функції створювати запит на бекенд для отримання масиву порід
// опрацьовуємо проміс, який повертається then(якщо успіх) i catch(якщо відповідь не надійшла)
// * 1.1. в then() прописуємо умову, якщо відповідь не ок. для цього ми примусово сетимо нову помилку
// за допомогою конструкції throw new Error(), де в параметрах прописуємо щось своє або скористатись
// властивість Response - statusText, яка одразу повідомляє яка помилка. Якщо все добре, то повертаємо
// розпарсений json

// ! 2. створити функцію fetchCatByBreed, яка очікує ідентифікатор породи(breedId), робить HTTP-запит
// і повертає проміс із даними про кота - результатом запиту.
// Якщо запит був успішний, під селектом у блоці div.cat-info з'являється зображення і розгорнута інформація
// про кота: назва породи, опис і темперамент.

// ! 3. за допомогою селектора створити змінні для елементів хтмл
// * 3.1. на select чіпляємо слухача, який приймає два параметри:
//  подія 'change' і колбек onSelectClick

// ! 4. функція onSelectClick приймає параметр evt
